{
  "aliases": {
    "title": "Aliases",
    "description": "Custom label:id pairs that let you reference users by your own identifiers (e.g., crm_user_id, database_id). An External ID must be set before aliases can be used."
  },
  "push": {
    "title": "Push Subscription",
    "description": "The push subscription for this device. Enables push notifications, in-app messages, and Live Activities (iOS only)."
  },
  "emails": {
    "title": "Email Subscriptions",
    "description": "Email addresses associated with this user for transactional and marketing email messaging."
  },
  "sms": {
    "title": "SMS Subscriptions",
    "description": "Phone numbers (in E.164 format) associated with this user for SMS and RCS messaging."
  },
  "tags": {
    "title": "Tags",
    "description": "Key-value string pairs attached to the user for segmentation and message personalization. Use tags for user properties like name, status, or preferences."
  },
  "triggers": {
    "title": "Triggers",
    "description": "Device-local key-value pairs that control when in-app messages are displayed. Triggers are not tags and are not sent to the server."
  },
  "outcomes": {
    "title": "Outcomes",
    "description": "Track user actions (count, value, or unique) attributed to push notifications to measure campaign impact."
  },
  "inAppMessaging": {
    "title": "In-App Messaging",
    "description": "Display targeted messages inside your app based on segments and triggers. Shown to all mobile subscriptions regardless of push opt-in status."
  },
  "location": {
    "title": "Location",
    "description": "Share device location (requires user permission) for location-based segmentation and messaging."
  },
  "trackEvent": {
    "title": "Track Event",
    "description": "Send custom events with optional properties to trigger Journeys, activate Wait Until steps, and power real-time personalized messaging."
  },
  "sendPushNotification": {
    "title": "Send Push Notification",
    "description": "Test push notifications by sending them to this device.",
    "options": [
      {
        "name": "Simple",
        "description": "Basic push notification with title and body text only."
      },
      {
        "name": "With Image",
        "description": "Push notification with a large image attachment (big picture style)."
      },
      {
        "name": "Custom",
        "description": "Create a custom notification with your own title and message content."
      }
    ]
  },
  "sendInAppMessage": {
    "title": "Send In-App Message",
    "description": "Test in-app message display formats. These trigger local IAMs for testing UI layouts.",
    "options": [
      {
        "name": "Top Banner",
        "description": "Slides in from the top of the screen. Best for non-intrusive alerts and quick info."
      },
      {
        "name": "Bottom Banner",
        "description": "Slides in from the bottom of the screen. Great for prompts and soft CTAs."
      },
      {
        "name": "Center Modal",
        "description": "Centered popup dialog. Ideal for important announcements requiring user attention."
      },
      {
        "name": "Full Screen",
        "description": "Takes over the entire screen. Best for onboarding, promotions, or rich media content."
      }
    ]
  }
}
